; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v6)
             (pred_4 ?v12 ?v9)
             (pred_11 ?v10 ?v9)
             (pred_7 ?v7 ?v10 )
	     (pred_3 ?v10)
             (pred_12 ?v1)
             (pred_2 ?v12)
             (pred_9 ?v9)
             (pred_1 ?v10)
             (pred_5 ?v12)
             (pred_6 ?v10)
             (pred_8 ))



(:action op_1
:parameters (?v13 ?v2 ?v3 ?v4)
:precondition (and (pred_12 ?v13) (pred_12 ?v2) (pred_2 ?v3) (pred_9 ?v4)
          (pred_10 ?v13 ?v2) (pred_4 ?v3 ?v4)
                   (pred_11 ?v2 ?v4) (pred_3 ?v13) 
                   (pred_1 ?v2) (pred_5 ?v3))
:effect (and  (pred_6 ?v2) (not (pred_1 ?v2))))


(:action op_5
:parameters (?v13 ?v5)
:precondition (and (pred_12 ?v13) (pred_12 ?v5)
               (pred_3 ?v13) (pred_10 ?v13 ?v5) (pred_6 ?v5))
:effect (and (pred_3 ?v5) (not (pred_3 ?v13))))

(:action op_3
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_2 ?v3) 
                  (pred_3 ?v13) (pred_7 ?v3 ?v13) (pred_8 ))
:effect (and (pred_5 ?v3)
   (not (pred_7 ?v3 ?v13)) (not (pred_8 ))))


(:action op_2
:parameters (?v13 ?v8 ?v11)
:precondition (and (pred_12 ?v13) (pred_2 ?v8) (pred_2 ?v11)
                  (pred_3 ?v13) (pred_5 ?v11) (pred_7 ?v8 ?v13))
:effect (and (pred_5 ?v8) (pred_7 ?v11 ?v13)
        (not (pred_5 ?v11)) (not (pred_7 ?v8 ?v13))))

(:action op_4
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_2 ?v3) 
                  (pred_3 ?v13) (pred_5 ?v3))
:effect (and (pred_8 ) (pred_7 ?v3 ?v13) (not (pred_5 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_01 obj_09 obj_20 obj_31 obj_05 obj_08 obj_02 obj_32 obj_27 obj_12 obj_25 obj_16 obj_17 obj_03 obj_22 obj_13 obj_07 obj_21 obj_14 obj_28 obj_18 obj_26 obj_29 obj_30 obj_11
    obj_15 obj_04 obj_10
    obj_24 obj_19 obj_23 obj_06
    )

    (:init
       (pred_8)

       (pred_12 obj_01)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_32)
       (pred_12 obj_27)
       (pred_12 obj_12)
       (pred_12 obj_25)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_03)
       (pred_12 obj_22)
       (pred_12 obj_13)
       (pred_12 obj_07)
       (pred_12 obj_21)
       (pred_12 obj_14)
       (pred_12 obj_28)
       (pred_12 obj_18)
       (pred_12 obj_26)
       (pred_12 obj_29)
       (pred_12 obj_30)
       (pred_12 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_2 obj_24)
       (pred_2 obj_19)
       (pred_2 obj_23)
       (pred_2 obj_06)

       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_09)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_20 obj_32)
       (pred_10 obj_20 obj_31)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_31 obj_27)
       (pred_10 obj_31 obj_05)
       (pred_10 obj_31 obj_20)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_31)
       (pred_10 obj_08 obj_25)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_32)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_32 obj_17)
       (pred_10 obj_32 obj_27)
       (pred_10 obj_32 obj_20)
       (pred_10 obj_32 obj_02)
       (pred_10 obj_27 obj_03)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_27 obj_31)
       (pred_10 obj_27 obj_32)
       (pred_10 obj_12 obj_22)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_25 obj_13)
       (pred_10 obj_25 obj_16)
       (pred_10 obj_25 obj_08)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_25)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_17 obj_32)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_03 obj_22)
       (pred_10 obj_03 obj_27)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_22 obj_28)
       (pred_10 obj_22 obj_12)
       (pred_10 obj_22 obj_03)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_25)
       (pred_10 obj_07 obj_26)
       (pred_10 obj_07 obj_21)
       (pred_10 obj_07 obj_16)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_21 obj_29)
       (pred_10 obj_21 obj_14)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_07)
       (pred_10 obj_14 obj_30)
       (pred_10 obj_14 obj_28)
       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_21)
       (pred_10 obj_28 obj_11)
       (pred_10 obj_28 obj_22)
       (pred_10 obj_28 obj_14)
       (pred_10 obj_18 obj_26)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_26 obj_29)
       (pred_10 obj_26 obj_07)
       (pred_10 obj_26 obj_18)
       (pred_10 obj_29 obj_30)
       (pred_10 obj_29 obj_21)
       (pred_10 obj_29 obj_26)
       (pred_10 obj_30 obj_11)
       (pred_10 obj_30 obj_14)
       (pred_10 obj_30 obj_29)
       (pred_10 obj_11 obj_28)
       (pred_10 obj_11 obj_30)
       (pred_1 obj_08)
       (pred_1 obj_12)
       (pred_1 obj_29)
       (pred_1 obj_09)
       (pred_11  obj_08 obj_15)
       (pred_11  obj_12 obj_04)
       (pred_11  obj_29 obj_10)
       (pred_11  obj_09 obj_10)
       (pred_6 obj_01)
       (pred_6 obj_20)
       (pred_6 obj_31)
       (pred_6 obj_05)
       (pred_6 obj_02)
       (pred_6 obj_32)
       (pred_6 obj_27)
       (pred_6 obj_25)
       (pred_6 obj_16)
       (pred_6 obj_17)
       (pred_6 obj_03)
       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_07)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_28)
       (pred_6 obj_18)
       (pred_6 obj_26)
       (pred_6 obj_30)
       (pred_6 obj_11)

       (pred_4  obj_24 obj_15)
       (pred_4  obj_19 obj_04)
       (pred_4  obj_23 obj_10)
       (pred_4  obj_06 obj_15)
       (pred_7 obj_24 obj_18)
       (pred_7 obj_19 obj_25)
       (pred_7 obj_23 obj_05)
       (pred_7 obj_06 obj_14)
       (pred_3 obj_32)
    )

    (:goal (and
       (pred_7 obj_24 obj_07)
       (pred_7 obj_23 obj_30)
    ))
(:constraints
  (always (not (pred_3 obj_21)))
)
)

; plan
1. (op_5 obj_32 obj_27)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_27)
   goals met: 0 of 2
2. (op_5 obj_27 obj_31)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_31)
   goals met: 0 of 2
3. (op_5 obj_31 obj_05)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_05)
   goals met: 0 of 2
4. (op_3 obj_05 obj_23)
   deleted: (pred_7 obj_23 obj_05) (pred_8)
   added: (pred_5 obj_23)
   goals met: 0 of 2
5. (op_5 obj_05 obj_31)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_31)
   goals met: 0 of 2
6. (op_5 obj_31 obj_27)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_27)
   goals met: 0 of 2
7. (op_5 obj_27 obj_03)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_03)
   goals met: 0 of 2
8. (op_5 obj_03 obj_14)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_14)
   goals met: 0 of 2
9. (op_5 obj_14 obj_30)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_30)
   goals met: 0 of 2
10. (op_1 obj_30 obj_29 obj_23 obj_10)
   deleted: (pred_1 obj_29)
   added: (pred_6 obj_29)
   goals met: 0 of 2
11. (op_4 obj_30 obj_23)
   deleted: (pred_5 obj_23)
   added: (pred_8) (pred_7 obj_23 obj_30)
   goals met: 1 of 2
12. (op_5 obj_30 obj_29)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_29)
   goals met: 1 of 2
13. (op_5 obj_29 obj_26)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_26)
   goals met: 1 of 2
14. (op_5 obj_26 obj_18)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_18)
   goals met: 1 of 2
15. (op_3 obj_18 obj_24)
   deleted: (pred_7 obj_24 obj_18) (pred_8)
   added: (pred_5 obj_24)
   goals met: 1 of 2
16. (op_5 obj_18 obj_13)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_13)
   goals met: 1 of 2
17. (op_5 obj_13 obj_07)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_07)
   goals met: 1 of 2
18. (op_4 obj_07 obj_24)
   deleted: (pred_5 obj_24)
   added: (pred_8) (pred_7 obj_24 obj_07)
   goals met: 2 of 2
